; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-1-7-5)
(:domain gripper-strips)
(:objects robot1 - robot
rgripper1 lgripper1 - gripper
room1 room2 room3 room4 room5 room6 room7 - room
ball1 ball2 ball3 ball4 ball5 - object)
(:init
(at-robby robot1 room2)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at ball1 room6)
(at ball2 room1)
(at ball3 room3)
(at ball4 room4)
(at ball5 room3)
)
(:goal
(and
(at ball1 room4)
(at ball2 room3)
(at ball3 room6)
(at ball4 room7)
(at ball5 room3)
)
)
)

; plan
1. (move robot1 room2 room7)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room7)
   goals met: 1 of 5
2. (move robot1 room7 room6)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room6)
   goals met: 1 of 5
3. (pick robot1 ball1 room6 lgripper1)
   deleted: (at ball1 room6) (free robot1 lgripper1)
   added: (carry robot1 ball1 lgripper1)
   goals met: 1 of 5
4. (move robot1 room6 room4)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room4)
   goals met: 1 of 5
5. (drop robot1 ball1 room4 lgripper1)
   deleted: (carry robot1 ball1 lgripper1)
   added: (at ball1 room4) (free robot1 lgripper1)
   goals met: 2 of 5
6. (pick robot1 ball4 room4 rgripper1)
   deleted: (at ball4 room4) (free robot1 rgripper1)
   added: (carry robot1 ball4 rgripper1)
   goals met: 2 of 5
7. (move robot1 room4 room7)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room7)
   goals met: 2 of 5
8. (drop robot1 ball4 room7 rgripper1)
   deleted: (carry robot1 ball4 rgripper1)
   added: (at ball4 room7) (free robot1 rgripper1)
   goals met: 3 of 5
9. (move robot1 room7 room6)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room6)
   goals met: 3 of 5
10. (move robot1 room6 room3)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room3)
   goals met: 3 of 5
11. (pick robot1 ball3 room3 lgripper1)
   deleted: (at ball3 room3) (free robot1 lgripper1)
   added: (carry robot1 ball3 lgripper1)
   goals met: 3 of 5
12. (move robot1 room3 room6)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room6)
   goals met: 3 of 5
13. (drop robot1 ball3 room6 lgripper1)
   deleted: (carry robot1 ball3 lgripper1)
   added: (at ball3 room6) (free robot1 lgripper1)
   goals met: 4 of 5
14. (move robot1 room6 room3)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room3)
   goals met: 4 of 5
15. (move robot1 room3 room1)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room1)
   goals met: 4 of 5
16. (pick robot1 ball2 room1 lgripper1)
   deleted: (at ball2 room1) (free robot1 lgripper1)
   added: (carry robot1 ball2 lgripper1)
   goals met: 4 of 5
17. (move robot1 room1 room3)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room3)
   goals met: 4 of 5
18. (drop robot1 ball2 room3 lgripper1)
   deleted: (carry robot1 ball2 lgripper1)
   added: (at ball2 room3) (free robot1 lgripper1)
   goals met: 5 of 5
